# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Bryan Orabutt\Documents\GitHub\ARC-Controller\PSoC-Code\ARC-Controller\ARC-EMBED.cydsn\ARC-EMBED.cyprj
# Date: Thu, 12 Jan 2017 06:18:49 GMT
#set_units -time ns
create_clock -name {TCPWM_CLK(FFB)} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/ff_div_11}] [get_pins {ClockBlock/ff_div_12}] [get_pins {ClockBlock/ff_div_13}] [get_pins {ClockBlock/ff_div_14}] [get_pins {ClockBlock/ff_div_15}] [get_pins {ClockBlock/ff_div_16}] [get_pins {ClockBlock/ff_div_17}] [get_pins {ClockBlock/ff_div_18}]]
create_clock -name {SPI_SCBCLK(FFB)} -period 62.5 -waveform {0 31.25} [list [get_pins {ClockBlock/ff_div_2}]]
create_clock -name {EZI2C_1_SCBCLK(FFB)} -period 625 -waveform {0 312.5} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {UART_SCBCLK(FFB)} -period 729.16666666666663 -waveform {0 364.583333333333} [list [get_pins {ClockBlock/ff_div_4}]]
create_clock -name {CyRouted1} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {TCPWM_CLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 5} [list]
create_generated_clock -name {SPI_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 7} [list]
create_generated_clock -name {SRV_CLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 25 49} [list [get_pins {ClockBlock/udb_div_0}]]
create_generated_clock -name {EZI2C_1_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 31 61} [list]
create_generated_clock -name {UART_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 35 71} [list]


# Component constraints for C:\Users\Bryan Orabutt\Documents\GitHub\ARC-Controller\PSoC-Code\ARC-Controller\ARC-EMBED.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Bryan Orabutt\Documents\GitHub\ARC-Controller\PSoC-Code\ARC-Controller\ARC-EMBED.cydsn\ARC-EMBED.cyprj
# Date: Thu, 12 Jan 2017 06:18:41 GMT
